print("Task Date: 16.10.2023")
print("Task 1:\n")

"""
Напишіть програму, яка запитує у користувача ім'я та
вік. Після отримання даних програма повинна виводити
привітання у форматі: "Привіт, {ім'я}! Твій вік — {вік}".
Обробіть виняток, що виникає при введенні некоректного
віку (вік < 0 або вік > 130), і виведіть повідомлення про
помилку. 
"""

def greet():
    name = input("Введіть ваше ім'я: ")
    age = input("Введіть ваш вік: ")

    try:
        age = int(age)
        if age < 0 or age > 130:
            raise ValueError("Некоректний вік")
        else:
            print(f"Привіт, {name}! Твій вік — {age}")
    except ValueError as e:
        print(f"Помилка: {e}")

# main
greet()